<template>
	 <view class="status_bar"></view>
	<!-- 导航 -->
	<view class="navigation">
		<view class="statusBar"></view>
		<view style="height: 80rpx;display: flex;align-items: center;justify-content: center;">
			<uni-icons type="back" @click="back()" size="19" style='position: absolute;left: 30rpx;'></uni-icons>
			<text style="color: #484848;font-size: 34rpx;">胆码选择</text>
		</view>
	</view>
	<view style="height: var(--status-bar-height);padding-top: 85rpx"></view>
	<view style="display: flex;flex-direction: column;padding: 0 20rpx;">
	<text style="font-weight: bold;">请用户在注册账户前仔细阅读本《用户服务协议》，一经注册成功即视为认可以下内容:</text><br/>
	<text>1、用户点击注册页面的注册按钮并完成注册程序、在获得账号和密码时，视为用户与运营、管理方已达成《用户服务协议》，自愿履行本协议的全部约定。</text><br/>
	<text>2、运营、管理方及用户均已认真阅读《用户服务协议》(下称“本协议)中的全部条款及发布的其他全部服务条款和操作规则，对本协议及前述服务条款和操作规则均已知晓、理解并接受，同意将其作为确定权利义务的依据。平台发布的《法律声明》为本协议的必要组成部分，用户接受本协议的同时即视为接受《法律声明》的全部内容。</text><br/>
	<text style="font-weight: bold;font-size: 34rpx;text-indent:0;">一、定义条款</text><br/>
	<text>1.1.用户可通过该平台投注站发起中国体育的预约信息,用户可通过投注站进行方案预约，并在成功预约后享受相应的出票、取票和兑奖等服务。</text><br/>
	<text>1.2."用户":接受并同意本协议全部条款及该平台发布的其他全部服务条款和操作规则，通过该平台进行预约信息发布的该平台注册用户。</text><br/>
	<text>1.3."投注站":由当地体育中心授权，合法从事线下销售中国体育的单位。</text><br/>
	<text>1.4."出票":投注站按照用户预约信息,通过当地体育中心发放的销售终端机打印相应的服务。</text><br/>
	<text>1.5.“取票”":用户有需求的情况下，与投注站协商在方案成功出票后自行到店领取票样,并自行到其他兑奖点兑奖。1.6."兑奖":方案中奖后投注站将在营业时间内进行派奖，奖金直接派到用户的账户内，如已协商申请取票则不重复派奖，由用户另行兑奖。</text><br/>
	
	<text style="font-weight: bold;font-size: 34rpx;text-indent:0;">二、用户注册</text><br/>
	<text>2.1.注册资格:</text><br/>
	<text>用户承诺:用户已年满21周岁，具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力，但经其法定代理人同意并由其法定代理人代理注册及应用该平台服务。</text><br/>
	<text>2.2.注册目的:</text><br/>
	<text>用户承诺:进行注册并非出于违反法律法规或破坏平台信息服务秩序的目的。</text><br/>
	<text>2.3.注册流程:</text><br/>
	<text>2.3.1.用户同意根据用户注册页面的要求提供有效手机号码等身份信息，设置昵称及密码，用户应确保所提供全部信息的真实性、完整性和准确性。</text><br/>
	<text>2.3.2.用户合法、完整并有效提供注册所需信息的，有权获得账号和密码，账号和密码用于用户在该平台进行普通用户登录。</text><br/>
	<text>2.3.3.用户获得账号及密码时视为用户注册成功，用户同意接受平台发送的与平台管理、运营相关的电话、系统消息或短消息。</text><br/>
	
	<text style="font-weight: bold;font-size: 34rpx;text-indent:0;">三、用户服务</text><br/>
	<text>3.1.服务内容:</text><br/>
	<text>3.1.1.用户有权在该平台发起预约信息,有权通过平台服务与投注站进行信息的沟通交流等。</text><br/>
	<text>3.1.2.用户有权使用该平台中的预约方案信息等功能。</text><br/>
	<text>3.1.3.用户有权按照该平台发布的活动规则参与网站组织的相关活动。</text><br/>
	<text>3.1.4.平台承诺为用户提供的其他服务。3.2.服务规则</text><br/>
	<text>用户承诺遵守下列服务规则:</text><br/>
	<text>3.2.1.用户应当遵守法律法规、规章、规范性文件及政策要求的规定,不得在该平台或利用服务从事非法或其他损害平台利益或第三方权益的活动，如不得发送或接收任何违法、违规、违反公序良俗、侵犯他人权益的信息,不得发送或接收传销材料或存在其他危害的信息或言论，未经授权不得以平台名义使用或伪造的电子邮件题头信息等。</text><br/>
	<text>3.2.2.用户应当遵守法律法规谨慎合理使用和妥善保管账号及密码,对其使用账号和密码后进行的行为和发生的事件负责。当用户发现账号被未经其授权的第三方使用或存在其他账号安全问题时应立即有效通知平台管理人员，要求管理人员暂停该账号的服务，并向公安机关报案。平台有权在合理时间内对用户的该等请求采取行动,但对采取行动前用户已经遭受的损失不承担任何责任。用户在未经该平台同意的情况下不得将账号以赠与、借用、租用、转让或其他方式转让给他人。</text><br/>
	<text>3.2.3.用户通过该平台进行信息沟通交流时，应当遵守本协议的全部约定及该平台发布的其他该平台服务条款和操作规则。</text><br/>
	<text>3.2.4.用户应当按照该平台发布的规则参加相关活动，遵守活动秩序。</text><br/>
	<text>3.2.5.该平台发布的其他服务条款和操作规则。</text><br/>
	
	<text style="font-weight: bold;font-size: 34rpx;text-indent:0;">四、服务规则</text><br/>
	<text>用户承诺在其进入该平台，通过该平台进行沟通交流的过程中遵守如下服务规则。</text><br/>
	<text>4.1.发布预约信息</text><br/>
	<text>用户在该平台发布预约信息时，应当发布完整的预约方案信息，预约信息中应包含但不限于方案的彩种、方案明细、金额、有效期等内容。用户应特别注意其中选号内容及金额等，预约信息发布并被投注站成功接单后，预约信息不允许修改或撤回。</text><br/>
	<text>4.2.代收款</text><br/>
	<text>平台接受投注站委托通过该平台代投注站向用户收取预约方案金额，并在投注站履行完预约信息的全部服务后将代收款转交投注站。具体方案和流程:在预约信息成立之后用户应根据预约方案明细页面显示的方案金额，将相应款项存至个人注册账户。在投注站确认接单后，平台向用户收取预约方案金额，即通过平台将用户个人账户中相应款项进行代收款操作。在投注站完整履行完预约信息的全部服务后，平台将相应代收款转交给投注站。</text><br/>
	<text>4.3.兑奖</text><br/>
	<text>用户中奖后投注站会在线上把奖金发至用户账户的可用余额内，如用户有需要进行线下兑奖，则通过取票形式拿到票样后自行到投注站或中心兑奖。</text><br/>
	<text>4.4.撤单退款规则</text><br/>
	<text>用户成功向投注站发起方案预约后，需要进行撤单退款的,按照如下规则通过该平台进行:</text><br/>
	<text>4.4.1.截止时间前,因不可抗力或投注站原因，导致投注站已接单但无法向用户完成出票和兑奖等服务，经工作人员核实后属实的，用户有权向投注站要求撤单;</text><br/>
	<text>4.4.2.用户与投注站已确认预约信息的(即投注站接单成功并完成出票的)，用户无权要求投注站或网站撤单或进行退款。</text><br/>
	<text>4.4.3.因不可抗力或投注站原因，导致投注站已接单但无法向用户完成出票和兑奖等服务,投注站主应主动与用户联系说明并及时操作撤单,需由投注站和用户双方协商解决。</text><br/>
	<text>4.4.4.在撤单进行过程中，用户应当遵守与撤单有关的服务条款和操作规则。</text><br/>
	<text>4.5.争议解决规则</text><br/>
	<text>如用户与投注站因预约方案的履行发生任何争议，包括但不限于方案的方案详情、投注内容、出票明细等内容问题发生争议的，用户应与投注站根据预约方案内容的约定确定用户与投注站各自的权利义务，承担各自的责任，采取协商或其他方式解决争议。平台服务包括在用户与投注站发生争议时可向用户提供双方的真实登记信息，并积极协助用户与投注站解决争议。</text><br/>
	
	<text style="font-weight: bold;font-size: 34rpx;text-indent:0;">五、用户的权利和义务</text><br/>
	<text>5.1.用户有权按照本协议约定接受平台所推出的服务。</text><br/>
	<text>5.2.用户有权选择是否订阅该平台发送的关于预约信息的电子邮件或短消息，并有权随时订阅或退订服务信息。</text><br/>
	<text>5.3.用户在使用该平台发起预约信息后，如发现投注站接受预约与发起预约存在内容不符等问题，与投注站协商后无法解决的,有权向该平台发起申诉。</text><br/>
	<text>5.4.用户在预约合同履行完毕后，有权随时终止使用各项服务。</text><br/>
	<text>5.5.用户应保证其在注册时和提交预约信息时所提供的姓名、联系方式、身份信息等全部信息真实、完整、准确，并当上述信息发生变更时及时进行更新。</text><br/>
	<text>5.6.用户在该平台使用预约信息服务时不得恶意干扰预约信息服务的正常进行、破坏该平台预约信息服务秩序。</text><br/>
	<text>5.7.用户不得以任何技术手段或其他方式干扰该平台的正常运行或干扰其他用户对平台服务的使用。</text><br/>
	<text>5.8.用户不得以虚构事实等方式恶意诋毁该平台或投注站等商家的商誉。</text><br/>
	<text>5.9.用户通过该平台使用预约信息服务应出于真实线上预约、线下购买之目的，不得以其他不正当目的使用信息服务或进行交易。</text><br/>
	
	<text style="font-weight: bold;font-size: 34rpx;text-indent:0;">六、平台的权利和义务</text><br/>
	<text>6.1.如用户不具备本协议约定的注册资格，则平台管理员有权拒绝用户进行注册，对已注册的用户有权注销其在该平台用户账号，平台因此而遭受损失的有权向前述用户主张赔偿。同时，平台拥有其他情况下决定是否接受用户注册的权利。</text><br/>
	<text>6.2.平台发现账号使用者并非账号初始注册人时，有权中止该账号的使用。</text><br/>
	<text>6.3.平台通过技术检测、人工抽检等检测方式合理怀疑用户提供的信息错误、不实、失效或不完整时，有权通知用户更正、更新信息或中止、终止为其提供在该平台的各项服务。</text><br/>
	<text>6.4.平台有权在发现该平台上显示的任何信息存在明显错误时，对信息予以更正。</text><br/>
	<text>6.5.平台有权修改、中止或终止用户在该平台提供的服务，平台行使前述权利将按照法律规定的程序及方式告知用户。</text><br/>
	<text>6.6.平台有权采取必要的技术手段和管理措施保障该平台的正常运行，并提供必要、可靠的信息服务环境，维护平台信息服务秩序。</text><br/>
	<text>6.7.如用户连续一年未使用用户账号和密码登录该平台，则平台管理员有权注销用户的平台账号。</text><br/>
	<text>6.8.平台有权在本协议履行期间及本协议终止后保留用户的注册信息及用户应用在使用服务期间的全部服务信息，但不得非法使用该等信息。</text><br/>
	<text>6.9.平台有权随时删除该平台内各类不符合国家法律法规、规范性文件的内容，平台行使该等权利无需提前通知用户。</text><br/>
	
	<text style="font-weight: bold;font-size: 34rpx;text-indent:0;">七、特别声明</text><br/>
	<text>7.1.用户未通过该平台与投注站之间进行的线下购买行为不属于平台所提供的服务，平台对不属于该平台服务的事项不承担任何责任，用户不得因其与投注站之间因此类购买行为发生的任何争议投诉平台或要求平台承担任何责任。不属于该平台服务的情况具体包括:用户未在该平台发起预约信息;用户虽在该平台发起预约信息，但未通过该平台接受预约信息而直接向投注站线下购买。</text><br/>
	<text>7.2.不论在何种情况下，平台对由于信息网络设备维护、信息网络连接故障、电脑、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令、其他不可抗力或第三方的不作为而造成的不能服务或延迟服务不承担责任。</text><br/>
	<text>7.3.为了用户更加方便和安全的使用该平台，平台将使用cookie收集用户与该平台有关的特征信息,用于标识用户的设备。同时，我们会积极采取先进的技术手段和有效的管理机制来保障用户的账号安全，保障用户的隐私信息不被任何未授权的设备使用或者泄露。</text><br/>
</view>
</template>

<script setup>
	import {
		onBeforeMount,
		onMounted,
		ref,
		reactive,
		getCurrentInstance,
	} from 'vue'
	const {
		proxy,
		ctx
	} = getCurrentInstance()
	
	const back = () =>{
		uni.navigateBack()
	}
</script>

<style>
	text{
		color: #3e3e3e;
		text-indent:1em;
	}
	.statusBar{
		width:100%;
		height: var(--status-bar-height);
		background-color: white;
	}
	
	/* 导航 */
	.navigation{
		width: 100%;
		background-color: white;
		display: flex;
		flex-direction: column;
		align-items: center;
		justify-content: center;
		box-shadow: 0 5rpx 15rpx -8rpx #ebebeb;
	}
</style>
